package StudyGroup.Study0415;
//1번부터 5번까지 if문 활용
//6번부터 10번까지 for문 활용
//11번부터 15번까지 while문 활용
//16번부터 20번까지 do-while문 활용
//21번부터 22번까지는 switch문 활용
public class Example {

//1. a가 100일때 true 출력하는 코드를 작성하시오. (a = 100)
//2. age가 0보다 작을때 : false, 0부터 7까지 중 하나일 때는 유치원, 8부터 13중 하나일 때는 초등학생,
//   14부터 16까지 중 하나일때는 중학생, 17부터 19까지중 하나일 때는 고등학생, 나머지일때는 성인을 출력하는코드를 작성하시오.
//3. boolean이 true면 참, false일때 거짓을 출력하는 코드를 작성하시오.
//num1은 10, num2는 20, num3은 100, num4는 50일때,
//4. 합이 50이상이면 true, 이외는 fales를 출력하는 코드를 작성하시오.
//5. num1과 num2의 곱이 num3과 num4의 합의 크기보다 큰것이 맞다면 true, 틀리다면 false를 출력하는 코드를 작성하시오.
//6. 철수는 13까지 숫자를 세었고 34까지의 숫자를 세어야 한다면 철수가 세어야 할 남은 숫자들을 출력하는 코드를 작성하시오.
//7. 0부터 5까지 숫자에 +3을 한 모든 수를 출력하시오
//8. 100부터 90까지의 숫자를 출력하시오
//9. 5번 반복해서 55,66,77,88,99,100을 출력하는 코드를 작성하시오.
//10. (o,p)o은 0부터 10까지,p은 100부터 90까지 출력하는 코드를 작성하시오.
//11. 철수는 13까지 숫자를 세었고 34까지의 숫자를 세어야 한다면 철수가 세어야 할 남은 숫자들을 출력하는 코드를 작성하시오.
//12. 0부터 5까지 숫자에 +3을 한 모든 수를 출력하시오
//13. 100부터 90까지의 숫자를 출력하시오
//14. 5번 반복해서 55,66,77,88,99,100을 출력하는 코드를 작성하시오.
//15. (q,w)q은 0부터 10까지,w은 100부터 90까지 출력하는 코드를 작성하시오.
//16. 철수는 13까지 숫자를 세었고 34까지의 숫자를 세어야 한다면 철수가 세어야 할 남은 숫자들을 출력하는 코드를 작성하시오.
//17. 0부터 5까지 숫자에 +3을 한 모든 수를 출력하시오
//18. 100부터 90까지의 숫자를 출력하시오
//19. 5번 반복해서 55,66,77,88,99,100을 출력하는 코드를 작성하시오.
//10. (z,x)z은 0부터 10까지,x은 100부터 90까지 출력하는 코드를 작성하시오.
//21. f가 10이고 g가 5일때 두 변수를 곱한 값이 50이면 '값은 60입니다.', 60이면 '값은 60입니다.'를 출력하는 코드를 작성하시오.
//22. numf는 100, nums는 50일때 두 수를 더한 값이 150이 맞다면 true, 틀리다면 false를 출력하는 코드를 작성하시오.

}
